InformationRegisters/СостоянияСинхронизацииТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияСинхронизацииТорговыеПредложения</Name>
			<Comment>Настройки и состояния публикуемых торговых предложений в сервисе 1С:Бизнес-сеть</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСинхронизацииТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеСинхронизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСинхронизацииТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хеш</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьСрокиПоставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОпубликованных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьРегионыДоступностиТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионыДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионыСамовывоза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПубликацииОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииОстатковТорговыеПредложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьСкидкиЗаРазовыйОбъемПродаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьЦенуДоСкидки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПубликацииСкидкиЗаОпт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПубликацииСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПубликацииСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликоватьКратностьУпаковок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговоеПредложение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговоеПредложение</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыПубликацииОстатковТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыПубликацииОстатковТорговыеПредложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоИНаличие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСинхронизацииТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияСинхронизацииТорговыеПредложения</Name>
			<Comment>Значения состояний синхронизации торговых предложений в сервисе 1С:Бизнес-сеть</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Синхронизировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяСинхронизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаСинхронизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТребуетсяСопоставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизированоЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияСинхронизацииТорговыеПредложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДействияСинхронизацииТорговыеПредложения</Name>
			<Comment>Значения действий синхронизации торговых предложений в сервисе 1С:Бизнес-сеть</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удаление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияСинхронизацииТорговыеПредложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Регистрирует данные для обработчика обновления
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = Метаданные.РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	ПараметрыВыборки                      = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.СпособВыборки        = ОбновлениеИнформационнойБазы.СпособВыборкиИзмеренияНезависимогоРегистраСведений();
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("ТорговоеПредложение");
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Организация");
	
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("ТорговоеПредложение");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Организация");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение КАК ТорговоеПредложение,
		|	СостоянияСинхронизацииТорговыеПредложения.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизацииТорговыеПредложения
		|ГДЕ
		|	(СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение > &ТорговоеПредложение
		|			ИЛИ СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение = &ТорговоеПредложение
		|				И СостоянияСинхронизацииТорговыеПредложения.Организация > &Организация)
		|	И СостоянияСинхронизацииТорговыеПредложения.ВариантПубликацииОстатков = ЗНАЧЕНИЕ(Перечисление.ВариантыПубликацииОстатковТорговыеПредложения.ПустаяСсылка)
		|	И СостоянияСинхронизацииТорговыеПредложения.ПубликоватьОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение,
		|	СостоянияСинхронизацииТорговыеПредложения.Организация";
	
	Организация         = Неопределено;
	ТорговоеПредложение = Неопределено;
	
	Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
	Запрос.УстановитьПараметр("Организация",         Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	РазмерПорцииДанных = 1000;
	
	Пока Истина Цикл
		
		Запрос.УстановитьПараметр("ТорговоеПредложение", ТорговоеПредложение);
		Запрос.УстановитьПараметр("Организация",         Организация);
		
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		КоличествоСтрок = Выгрузка.Количество();
		
		Если КоличествоСтрок = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Выгрузка, ДополнительныеПараметры);
		
		Если КоличествоСтрок < РазмерПорцииДанных Тогда
			Прервать;
		КонецЕсли;
		
		ПоследняяСтрока = Выгрузка[КоличествоСтрок - 1];
		
		ТорговоеПредложение = ПоследняяСтрока.ТорговоеПредложение;
		Организация         = ПоследняяСтрока.Организация;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - параметры.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения;
	ПолноеИмяОбъекта  = МетаданныеОбъекта.ПолноеИмя();
		
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ЕстьОтработанныеЗаписи = Ложь;
	ПроизошлаОшибка        = Ложь;
	ТекстСообщения         = "";
	
	Для Каждого ТекущаяСтрокаРегистра Из ОбновляемыеДанные Цикл
				
		НачатьТранзакцию();
		
		Попытка
			
			НаборЗаписей = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ТорговоеПредложение.Установить(ТекущаяСтрокаРегистра.ТорговоеПредложение);
			НаборЗаписей.Отбор.Организация.Установить(ТекущаяСтрокаРегистра.Организация);
			
			ОбщегоНазначенияБЭД.УстановитьУправляемуюБлокировкуПоНаборуЗаписей(НаборЗаписей);
			
			НаборЗаписей.Прочитать();
			
			Записать = Ложь;
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ТекущаяЗапись = НаборЗаписей[0];
				
				Если Не ЗначениеЗаполнено(ТекущаяЗапись.ВариантПубликацииОстатков) Тогда
					
					Записать = Истина;
					
					ТекущаяЗапись.ВариантПубликацииОстатков = Перечисления.ВариантыПубликацииОстатковТорговыеПредложения.Наличие;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Записать Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЕстьОтработанныеЗаписи = Истина;
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ШаблонСообщения = НСтр("ru = 'Не удалось обработать запись по торговому предложению %1 по причине:'");
			ТекстСообщения = СтрШаблон(ШаблонСообщения, ТекущаяСтрокаРегистра.ТорговоеПредложение) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				МетаданныеОбъекта, ТекущаяСтрокаРегистра.ТорговоеПредложение, ТекстСообщения);
				
			ПроизошлаОшибка = Истина;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не ЕстьОтработанныеЗаписи И ПроизошлаОшибка Тогда
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Изменить реквизит записи регистра.
// 
// Параметры:
//  ТорговоеПредложение - ОпределяемыйТип.ТорговоеПредложение - Торговое предложение
//  ИмяРеквизита - Строка - Имя реквизита.
//  Значение - Произвольный - устанавливаемое значение реквизита.
//
Процедура СоздатьИзменитьЗаписьРегистра(ТорговоеПредложение, ИмяРеквизита, Значение) Экспорт
	
	ТекущаяЗапись = СоздатьМенеджерЗаписи();
	ТекущаяЗапись.ТорговоеПредложение = ТорговоеПредложение;
	
	СвойстваПредложения = Новый Структура("Организация, Валюта");
	ТорговыеПредложенияПереопределяемый.ПолучитьСвойстваТорговогоПредложения(ТорговоеПредложение, СвойстваПредложения);
	ТекущаяЗапись.Организация = СвойстваПредложения.Организация;
	ТекущаяЗапись.Прочитать();
	
	Если Не ТекущаяЗапись.Выбран() Тогда
		ТекущаяЗапись.ТорговоеПредложение = ТорговоеПредложение;
		ТекущаяЗапись.Организация = СвойстваПредложения.Организация;
	КонецЕсли;
	
	ТекущаяЗапись[ИмяРеквизита] = Значение;
	Если Не ТекущаяЗапись.Отключено Тогда
		ТекущаяЗапись.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация;
	КонецЕсли;
	ТекущаяЗапись.Записать();
	
КонецПроцедуры

// См. ТорговыеПредложенияСлужебный.ИзменитьСостояниеПубликацииПрайсЛистов
//
Процедура ИзменитьСостояниеПубликацииПрайсЛистов(ПараметрыМетода) Экспорт
	
	Для Каждого ЭлементКоллекции Из ПараметрыМетода.ТорговыеПредложения Цикл
		
		Отбор = Новый Структура("ТорговоеПредложение", ЭлементКоллекции);
		
		Выборка = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.Выбрать(Отбор);
		
		Если Выборка.Следующий() Тогда
			
			МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
			
			СброситьДату = Ложь;
			Если ПараметрыМетода.ЭтоУдаление Тогда
				МенеджерЗаписи.ДействиеСинхронизации = Перечисления.ДействияСинхронизацииТорговыеПредложения.Удаление;
				СброситьДату = Истина;
			ИначеЕсли ПараметрыМетода.ЭтоОтменаУдаления Тогда
				МенеджерЗаписи.ДействиеСинхронизации = Перечисления.ДействияСинхронизацииТорговыеПредложения.Изменение;
				СброситьДату = Истина;
			ИначеЕсли ПараметрыМетода.ЭтоОтключениеПубликации Тогда
				МенеджерЗаписи.Отключено = Истина;
				СброситьДату = Истина;
			ИначеЕсли ПараметрыМетода.ЭтоВключениеПубликации Тогда
				МенеджерЗаписи.Отключено = Ложь;
				СброситьДату = Истина;
			КонецЕсли;
			
			МенеджерЗаписи.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация;
			
			Если СброситьДату Тогда
				МенеджерЗаписи.ДатаСинхронизации = '00010101';
			КонецЕсли;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// См. ТорговыеПредложенияСлужебный.УстановитьСостояниеТорговыхПредложений
//
Процедура УстановитьСостояниеТорговыхПредложений(ИзмененныеПрайсЛисты) Экспорт
	
	ПрайсЛисты = Новый Массив;
	
	Для каждого ПрайсЛист Из ИзмененныеПрайсЛисты Цикл
		ПрайсЛисты.Добавить(ПрайсЛист.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение КАК ТорговоеПредложение,
	|	СостоянияСинхронизацииТорговыеПредложения.Организация КАК Организация
	|ИЗ
	|	РегистрСведений.СостоянияСинхронизацииТорговыеПредложения КАК СостоянияСинхронизацииТорговыеПредложения
	|ГДЕ
	|	СостоянияСинхронизацииТорговыеПредложения.ТорговоеПредложение В(&ИзмененныеПрайсЛисты)");
	
	Запрос.УстановитьПараметр("ИзмененныеПрайсЛисты", ПрайсЛисты);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.СостоянияСинхронизацииТорговыеПредложения.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаЗапроса);
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ МенеджерЗаписи.Отключено Тогда
			МенеджерЗаписи.Состояние = Перечисления.СостоянияСинхронизацииТорговыеПредложения.ТребуетсяСинхронизация;
		КонецЕсли;
		
		МенеджерЗаписи.КоличествоОпубликованных = 
			МенеджерЗаписи.КоличествоОпубликованных - ИзмененныеПрайсЛисты[ВыборкаЗапроса.ТорговоеПредложение];
		МенеджерЗаписи.Записать(Истина);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
